####Inflection types ###########
from __future__ import annotations

godan: set[str] = {
    "五段・サ行",
    "五段・ラ行",
    "五段・マ行",
    "五段・バ行",
    "五段・ワ行促音便",
    "五段・カ行促音便ユク",
    "五段・ワ行ウ音便",
    "五段・ナ行",
    "五段・カ行促音便",
    "五段・タ行",
    "五段・ガ行",
    "五段・ラ行特殊",
    "五段・カ行イ音便",
    "五段・ラ行アル"
}

ichidan: set[str] = {
    "一段・得ル",
    "一段・クレル",
}

adjective: set[str] = {
    "形容詞・イ段",
    "形容詞・アウオ段",
    "形容詞・イイ",
}

sahen: set[str] = {
    "サ変・スル",
    "サ変・−スル",
    "サ変・−ズル",
}

kahen: set[str] = {
    "カ変・来ル",
    "カ変・クル",
}

bungo: set[str] = {
    "文語・ナリ",
    "文語・ル",
    "文語・キ",
    "文語・ゴトシ",
    "文語・ケリ",
    "文語・リ",
    "文語・ベシ",
}

special_class: set[str] = {
    "特殊・マス",
    "特殊・ヤ",
    "特殊・ジャ",
    "特殊・タ",
    "特殊・ナイ",
    "特殊・ヌ",
    "特殊・ダ",
    "特殊・タイ",
    "特殊・デス",
}

yodan: set[str] = {
    "四段・ハ行",
    "四段・バ行",
}

ruhen: set[str] = {
    "ラ変",
}

who_knows: set[str] = {
    "下二・ダ行",
    "下二・タ行",
}

indeclinable: set[str] = {
    "不変化型", "一段",
}
