from __future__ import annotations


# noinspection PyUnusedName,PyUnusedClass
class HiraganaChart:
    k_index = 1
    s_index = 2
    t_index = 3
    n_index = 4
    h_index = 5
    m_index = 6
    y_index = 7
    r_index = 8
    w_index = 9

    a_row_1 = ["あ", "か", "さ", "た", "な", "は", "ま", "や", "ら", "わ"]
    a_row_2 = ["　", "が", "ざ", "だ", "　", "ば", "　", "　", "　", "　"]
    a_row_3 = ["　", "　", "　", "　", "　", "ぱ", "　", "　", "　", "　"]

    i_row_1 = ["い", "き", "し", "ち", "に", "ひ", "み", "　", "り", "　"]
    i_row_2 = ["　", "ぎ", "じ", "ぢ", "　", "び", "　", "　", "　", "　"]
    i_row_3 = ["　", "　", "　", "　", "　", "ぴ", "　", "　", "　", "　"]

    u_row_1 = ["う", "く", "す", "つ", "ぬ", "ふ", "む", "ゆ", "る", "　"]
    u_row_2 = ["　", "ぐ", "ず", "づ", "　", "ぶ", "　", "　", "　", "　"]
    u_row_3 = ["　", "　", "　", "　", "　", "ぷ", "　", "　", "　", "　"]

    e_row_1 = ["え", "け", "せ", "て", "ね", "へ", "め", "　", "れ", "　"]
    e_row_2 = ["　", "げ", "ぜ", "で", "　", "べ", "　", "　", "　", "　"]
    e_row_3 = ["　", "　", "　", "　", "　", "ぺ", "　", "　", "　", "　"]

    o_row_1 = ["お", "こ", "そ", "と", "の", "ほ", "も", "よ", "ろ", "を"]
    o_row_2 = ["　", "ご", "ぞ", "ど", "　", "ぼ", "　", "　", "　", "　"]
    o_row_3 = ["　", "　", "　", "　", "　", "ぽ", "　", "　", "　", "　"]
