from __future__ import annotations


# noinspection PyUnusedName,PyUnusedClass
class KatakanaChart:
    k_index = 1
    s_index = 2
    t_index = 3
    n_index = 4
    h_index = 5
    m_index = 6
    y_index = 7
    r_index = 8
    w_index = 9

    a_row_1 = ["ア", "カ", "サ", "タ", "ナ", "ハ", "マ", "ヤ", "ラ", "ワ"]
    a_row_2 = ["　", "ガ", "ザ", "ダ", "　", "バ", "　", "　", "　", "　"]
    a_row_3 = ["　", "　", "　", "　", "　", "パ", "　", "　", "　", "　"]

    i_row_1 = ["イ", "キ", "シ", "チ", "ニ", "ヒ", "ミ", "　", "リ", "　"]
    i_row_2 = ["　", "ギ", "ジ", "ヂ", "　", "ビ", "　", "　", "　", "　"]
    i_row_3 = ["　", "　", "　", "　", "　", "ピ", "　", "　", "　", "　"]

    u_row_1 = ["ウ", "ク", "ス", "ツ", "ヌ", "フ", "ム", "ユ", "ル", "　"]
    u_row_2 = ["　", "グ", "ズ", "ヅ", "　", "ブ", "　", "　", "　", "　"]
    u_row_3 = ["　", "　", "　", "　", "　", "プ", "　", "　", "　", "　"]

    e_row_1 = ["エ", "ケ", "セ", "テ", "ネ", "ヘ", "メ", "　", "レ", "　"]
    e_row_2 = ["　", "ゲ", "ゼ", "デ", "　", "ベ", "　", "　", "　", "　"]
    e_row_3 = ["　", "　", "　", "　", "　", "ペ", "　", "　", "　", "　"]

    o_row_1 = ["オ", "コ", "ソ", "ト", "ノ", "ホ", "モ", "ヨ", "ロ", "ヲ"]
    o_row_2 = ["　", "ゴ", "ゾ", "ド", "　", "ボ", "　", "　", "　", "　"]
    o_row_3 = ["　", "　", "　", "　", "　", "ポ", "　", "　", "　", "　"]
